#Ковалёв Стас Вариант 4
print("start code …")

books = [{"title":"Война и мир", "author" : "Лев Толстой", "year" : "1869"},
 {"title": "Мёртвые души" , "author": "Николай Гоголь" , "year": "1842"},
 {"title": "Мастер и Маргарита" , "author":"Михаил Булгаков" , "year":"1929"},
 {"title": "Собачье сердце", "author": "Михаил Булгаков", "year":"1925"},
 {"title": "Преступление и наказание", "author": "Фёдор Достоевский", "year":"1866"}]

i = 1
for book in books:
    print(f" ---------------------- Книга {i} -----------------------")
    print(f"Название: {book['title']}, Автор: {book['author']}")
    print(f" ---------------------- {book['year']} ----------------------")
    print()
    i+=1


print("end code …")